{"thumbs_up":true,"text":"well i went to Pharmacy, why the hell they don't have a vampire survivors patch?","helpful_votes":6,"funny_votes":0,"reward":0,"gametime_record":13.2,"cleaned_text":"well went pharmacy hell dont vampire survivor patch"}
{"thumbs_up":true,"text":"Cross is better than Heaven Sword.","helpful_votes":2,"funny_votes":0,"reward":0,"gametime_record":73.3,"cleaned_text":"cross better heaven sword"}
{"thumbs_up":true,"text":"The game is so addicting, you start and suddenly it's 4 hours later.","helpful_votes":2,"funny_votes":0,"reward":0,"gametime_record":15.1,"cleaned_text":"game addict start sudden 4 hour later"}
{"thumbs_up":false,"text":"there is no feet","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":45.0,"cleaned_text":"foot"}
{"thumbs_up":true,"text":"Im hooked, and cannot put this game down.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":22.4,"cleaned_text":"im hook cannot put game"}
{"thumbs_up":true,"text":"If there was a game like this in our childhood, we would be as smart as Albert Einstein now.\"do not play for a long time you will get sick from blood clots\"","helpful_votes":5,"funny_votes":1,"reward":0,"gametime_record":8.1,"cleaned_text":"game like childhood would smart albert einstein now play long time get sick blood clot"}
{"thumbs_up":true,"text":"cool","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":7.8,"cleaned_text":"cool"}
{"thumbs_up":true,"text":"The garlic looks like balls and it's, like, arguably the best weapon in the game.20\/10 game.Play it.","helpful_votes":1,"funny_votes":1,"reward":0,"gametime_record":39.6,"cleaned_text":"garlic look like ball like arguably best weapon game2010 gameplay"}
{"thumbs_up":true,"text":"Very addicting game do not play","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":10.3,"cleaned_text":"addict game play"}
{"thumbs_up":true,"text":"This game is disgustingly addictive, and just watching the pixels fly is a total blast for some reason. You will not regret it!","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":45.3,"cleaned_text":"game disgust addict watch pixel fli total blast reason regret"}
{"thumbs_up":true,"text":"fun","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":43.1,"cleaned_text":"fun"}
{"thumbs_up":true,"text":"don't let the graphics put you off. this is too addicting!!","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":9.8,"cleaned_text":"dont let graphic put addict"}
{"thumbs_up":true,"text":"The best kind of chaos.","helpful_votes":1,"funny_votes":1,"reward":0,"gametime_record":19.3,"cleaned_text":"best kind chan"}
{"thumbs_up":true,"text":"Great `Goopy Goblin Gamer Brain' nourishment.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":15.6,"cleaned_text":"great good goalie gamer brain tourism"}
{"thumbs_up":true,"text":"Scarily addictive game, yet super satisfying to 100% the steam achievements for this one. Both the game and the DLC well worth more than the charging price. With infinite replay-ability and plenty of hidden characters to unlock, i can easily recommend for anyone looking for some mindless fun.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":68.2,"cleaned_text":"scaring addict game yet super satisfy 100 steam achieve one game dlc well worth charg price infinite replay plenty hidden character unlock easily recommend anyone look mindless fun"}
{"thumbs_up":true,"text":"Game Khubie. Makhsusan vaghti emtehano be khatere ADHD va goshadi oftadi.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":22.6,"cleaned_text":"game hub makhsusan vaghti emtehano later add va goshawk oftadi"}
{"thumbs_up":true,"text":"Vampire Survivors is proof that a game doesn't have to be super complex to be an incredibly good time. Highly recommend this game to anyone","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":15.5,"cleaned_text":"vampire survivor proof game doesnt super complex injured good time high recommend game anyone"}
{"thumbs_up":true,"text":"A flashback to a time before credit cards were required to unlock items in game.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":20.6,"cleaned_text":"flashback time credit card require unlock item game"}
{"thumbs_up":true,"text":"New player in this game, surprised on how good this game is. Only priced for 5 dollars to get this addictive game is truly amazing experience. The upgrading system in this game is also worth to grind, even the game mechanics is very easy to understand by beginner. So far, a really great experience even though I've been playing this game for only 3 hours. Absolute time-killing game.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":7.9,"cleaned_text":"new player game surprise good game price 5 dollar get addict game truly ama expert upgrade system game also worth grind even game meghan east understand begin far really great expert even though ive play game 3 hour absolute timekil game"}
{"thumbs_up":true,"text":"If your on the fence about this game, don't let the graphics or simplicity of combat mislead you. You will not get more bang for buck out of any other game. 10\/10 in my books","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":76.6,"cleaned_text":"enc game dont let graphic simply combat mislead get bang buck game 1010 book"}
{"thumbs_up":true,"text":"Excellent value for money!For the price of what ever change i could scrounge up this game is more than worth the price. Extremely fun and addicting but easy to play.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":12.6,"cleaned_text":"excel value moneyfor price ever chang could strong game worth price extreme fun addict east play"}
{"thumbs_up":true,"text":"Its like crack but shiner","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":17.2,"cleaned_text":"like crack shiner"}
{"thumbs_up":true,"text":"Very entertaining and addicting game. I wasn't fully into it before playing but after playing for a couple hours I knew I wanted to 100% the game achievements wise. It can be boring at times since a lot of the end game end up being just standing still, but also that's not a bad thing since I'd pretty much always have something open to watch\/read on my 2nd monitor.And of course, highly recommend trying the game even if you're not that much interested in this types of games, a 98% positive review with over 170K reviews is not for nothing.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":45.0,"cleaned_text":"entertain addict game wasnt full play play couple hour knew want 100 game achieve wise bore time since lot end game end stand still also that bad thing since id pretty much away some open watched 2nd monitoring cours high recommend tri game even your much interest type game 98 post review 170k review not"}
{"thumbs_up":true,"text":"very addicting. Very high replayability (if that's even a word lol)","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":39.5,"cleaned_text":"addict high replay that even word lol"}
{"thumbs_up":true,"text":"Product received for freeThis game was given to me by a friend with a note saying \" Be careful, This game is Addicting \" and Boy, were they not kidding.The game starts off nice and slow with a few characters and item slots, and before you know it you are trying different weapon combos while collecting so many exp gems you may start to think maybe your mom's addiction to Bejeweled might not be as weird as you thought.DLC is awesome too!","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":122.1,"cleaned_text":"product receive freethi game given friend note say care game addict boy kidding game start nice slow character item slot know tri differ weapon combo collect mani exp gem may start think may mom addict jewel might weird thoughtdlc awesome"}
{"thumbs_up":true,"text":"goty","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":4.5,"cleaned_text":"got"}
{"thumbs_up":true,"text":"good","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":118.1,"cleaned_text":"good"}
{"thumbs_up":true,"text":"Watching game play of this game simply cannot convey how fun and addictive it is, despite its relative simplicity. The biggest pluses here are the game play, the price point and the lack of predatory monetization practices (micro-transactions). There really is no good reason not to at least give this one a try.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":14.4,"cleaned_text":"watch game play game simply cannot convey fun addict despite relay simply biggest plus game play price point lack predatory money practice microtransact really good reason least give one tri"}
{"thumbs_up":true,"text":"The ONLY game in my library, which i just HAD to 100%! No other game made me do this :D","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":80.2,"cleaned_text":"game library 100 game made"}
{"thumbs_up":true,"text":"This game saved my lifeI am 27.My ex-wife and I have a daughter together, and adopted our son together. They are now both 4 years old.When we were going through our separation, I found myself lost and miserable. I was self destructive. I got so mad one day from everything spiraling out of my control that I punched some concrete in a moment of overwhelming emotion. That caused me to break my 5th metacarpal in my right hand... my working hard... my games hand.. the hand that I held and carried my children to bed with. The hand I desperately needed to make sure I could continue to provide.After learning of the severity of my self-inflicted damage, I was borderline suicidal. Keep in mind that just a few months before this. I was the happiest man with no history of depression or anxicty. I have never had fits of rage, or been one to break down and cry, but I was In a low spot that just really buried me from being able to see the light on the other sideHaving nothing better to do. I searched for a game I could play, ONE HANDED while recovered. I somehow stumbled upon this game and read some of the reviews. I decided that it had to be worth a shot.... I must admit. I didn't beat the game, or play nearly as long as some of you. In fact. I may have only played this game a day or two. With that being said, after doing so. I had a new found joy and hope for life. I was able to put behind me the pain and suffering that had been cast over me. I was able to experience other peoples joy and happiness. I was able to see the fruits of my \"labor\". I relaxed for 5 wwwwing minutes to this music long enough to realize that I was going to be okayAfter coming to that realization, I turned the game off, and I went back to work. It hurt my hand like hell but I was motivated. I stopped feeling so damn sorry for myself, and became the father I needed to be in that moment, not the weak boy I was behaving as.","helpful_votes":2,"funny_votes":2,"reward":0,"gametime_record":4.0,"cleaned_text":"game save life 27mi exit daughter together adopt son together 4 year oldwhen go spear found lost miner self destruct got mad one day every spiral control punch concert moment overwhelm mot cap break 5th metacarp right hand work hard game hand hand held carry child bed hand deeper need make sure could continue provideaft learn sever selfinflict damage borderline suicide keep mind month happiest man history press anxiety never fit rage one break cri low spot really burn abl see light sidebar not better search game could play one hand recon somehow stumble upon game read review decide worth shot must admit didnt beat game play near long fact may play game day two said new found joy hope life abl put behind pain suffer cast abl expert people joy happy abl see fruit labor relax 5 wwwwing minut music long enough realize go okayaft come realize turn game went back work hurt hand like hell motif stop feel damn sorry became father need moment weak boy behave"}
{"thumbs_up":true,"text":"Just amazing survival game with a lot of progress improvements and different builds to be used to progress further. Highly recommended for 2D survival lovers. This game and Brotato are true gems!","helpful_votes":3,"funny_votes":0,"reward":0,"gametime_record":21.6,"cleaned_text":"ama survive game lot progress improv differ build use progress high recommend 2d survive lover game potato true gem"}
{"thumbs_up":true,"text":"This is a survival game.Survive with the character of your choice.Each character has its own weapons and abilities.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":40.3,"cleaned_text":"survive gamesurv character choiceeach character weapon bail"}
{"thumbs_up":true,"text":"you better get some beefy PC for some of the stuff that's goin on in this game lmao and sunglasses are recommended, 10\/10","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":56.7,"cleaned_text":"better get beef pc stuff that going game lmaz sunglass recommend 1010"}
{"thumbs_up":true,"text":"Still more content than Halo Infinite ~ 2\/4\/2023But in all seriousness.. the dollar to hour value is great, well over 100+ hours and I still have fun with the game.I wasn't into this kind of game before but now I'm a fan. If this game looks even just the littlest bit fun or interesting don't hesitate to try it out.Great game!","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":139.5,"cleaned_text":"still content halo infinite 242023but serious dollar hour value great well 100 hour still fun game wasnt kind game im fan game look even little bit fun interest dont heist tri outbreak game"}
{"thumbs_up":true,"text":"gud","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":22.6,"cleaned_text":"gun"}
{"thumbs_up":true,"text":"fun game i like it","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":15.9,"cleaned_text":"fun game like"}
{"thumbs_up":true,"text":"It's very good. I play it on my phone too. (It's free on mobile)","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":14.4,"cleaned_text":"good play phone free mobil"}
{"thumbs_up":true,"text":"Liked: simple idea, great executionDesliked: addiction","helpful_votes":2,"funny_votes":1,"reward":0,"gametime_record":0.3,"cleaned_text":"like simply idea great executiondeslik addict"}
{"thumbs_up":true,"text":"Large doses of dopamine","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":55.8,"cleaned_text":"lang dose dopamine"}
{"thumbs_up":true,"text":"So Vampire Survivors is an interesting gem.  I honestly have not had this much fun with a game since I was a young lad.  Great on the Steam Deck.  Probably the foremost portable PC game.  I also enjoyed the game on the big screen.  All around a no brainer.  Buy the game.  You wont regret it.","helpful_votes":2,"funny_votes":0,"reward":0,"gametime_record":67.6,"cleaned_text":"vampire survivor interest gem honest much fun game since young lad great steam deck probably foremost portal pc game also enjoy game big screen around brainer buy game wont regret"}
{"thumbs_up":true,"text":"You think its just about moving around and leveling up, but its really about fantasizing about being rich!","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":137.6,"cleaned_text":"think move around level really fantasy rich"}
{"thumbs_up":true,"text":"fun cheap game","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":3.8,"cleaned_text":"fun cheap game"}
{"thumbs_up":true,"text":"The most game, game to ever game.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":1.2,"cleaned_text":"game game ever game"}
{"thumbs_up":true,"text":"Amazing game. The player is the bullet hell this time around.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":31.4,"cleaned_text":"ama game player bullet hell time around"}
{"thumbs_up":true,"text":"I whipped out thousands of enemys.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":61.6,"cleaned_text":"whip thousand enemy"}
{"thumbs_up":false,"text":"The bad kind of addictingAt first I was a bit frustrated because I didn't know to play the game.Then I figured out the upgrade system and I felt a power rush.When I was OP, I could not stop playing the game even though nothing changed but the crates and coins just triggered something in my brain. I hate-played the game. That's probably what those predatory mobile games use to rip people off.At some point I uninstalled the game and haven't looked back.","helpful_votes":3,"funny_votes":0,"reward":0,"gametime_record":11.8,"cleaned_text":"bad kind addictingat first bit frustrated didnt know play gamethen figure upgrade system felt power rushwhen op could stop play game even though not chang crate coin trigger some brain gameplay game that probably predatory mobil game use rip people off point unispal game havent look back"}
{"thumbs_up":true,"text":"Warning, this game is very addictive :]","helpful_votes":2,"funny_votes":0,"reward":0,"gametime_record":41.7,"cleaned_text":"warn game addict"}
{"thumbs_up":true,"text":"incredibly addictive for such a low price. i've sunk almost 70 hours into it at his point and no regrets lol","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":79.7,"cleaned_text":"injured addict low price ive sunk almost 70 hour point regret lol"}
{"thumbs_up":true,"text":"fun,cheap and satysfying game with nice 8-bit graphic stylei like variety of items,their evolved versions and characters. my favourite one is definetly this garlic old mansummarizing this game is like drugs","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":16.7,"cleaned_text":"funcheap satisfy game nice 8bit graphic style like variety itemstheir evolve version character favourite one defined garlic old mansummar game like drug"}
{"thumbs_up":true,"text":"---{ Graphics }---☑ You forget what reality is☐ Beautiful☐ Good☐ Decent☐ Bad☐ Don‘t look too long at it☐ MS-DOS---{ Gameplay }---☑ Very good☐ Good☐ It's just gameplay☐ Mehh☐ Watch paint dry instead☐ Just don't---{ Audio }---☑ Eargasm☐ Very good☐ Good☐ Not too bad☐ Bad☐ I'm now deaf---{ Audience }---☑ Kids☑ Teens☑ Adults☑ Grandma☑ Vampires---{ PC Requirements }---☑ Check if you can run paint☐ Potato☐ Decent☐ Fast☐ Rich boi☐ Ask NASA if they have a spare computer---{ Difficulty }---☐ Just press 'W'☐ Easy☐ Easy to learn \/ Hard to master☐ Significant brain usage☐ Difficult☑ Vampire Survivors---{ Grind }---☐ Nothing to grind☐ Only if u care about leaderboards\/ranks☐ Isn't necessary to progress☐ Average grind level☐ Too much grind☑ You'll need a second life for grinding---{ Story }---☐ No Story☐ Some lore☐ Average☐ Good☐ Lovely☑ It'll replace your life---{ Game Time }---☐ Long enough for a cup of coffee☐ Short☐ Average☐ Long☑ To infinity and beyond---{ Price }---☑ It's free! (basically)☐ Worth the price☐ If it's on sale☐ If u have some spare money left☐ Not recommended☐ You could also just burn your money---{ Bugs }---☑ Never heard of☐ Minor bugs☐ Can get annoying☐ ARK: Survival Evolved☐ The game itself is a big terrarium for bugs---{ ? \/ 10 }---☐ 1☐ 2☐ 3☐ 4☐ 5☐ 6☐ 7☐ 8☐ 9☐ 10☑ Ꝏ","helpful_votes":1,"funny_votes":1,"reward":0,"gametime_record":31.3,"cleaned_text":"graphic forget reality beauty good decent bad dont look long msds gameplay good good gameplay mesh watch paint doi instead dont audio sarcasm good good bad bad im deaf audience kid teen adult grand vampire pc require check run paint potato decent fast rich boi ask nasa spare compute difficult press w east east learn hard master signifies brain usage difficult vampire survivor grind not grind u care leaderboardsrank isnt necessary progress average grind level much grind you need second life grind story story lore average good love till replace life game time long enough cup coffee short average long infin beyond price free basic worth price sale u spare money left recommend could also burn money bug never heard minor bug get annoy ark survive evolve game big terrorism bug 10 1 2 3 4 5 6 7 8 9 10"}
{"thumbs_up":true,"text":"My 6 year old son got addicted to this game and died from a Vampire Saviours related overdose.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.0,"cleaned_text":"6 year old son got addict game die vampire savior relay overdose"}
{"thumbs_up":true,"text":"its grrrreat","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":36.9,"cleaned_text":"grrrreat"}
{"thumbs_up":false,"text":"I struggle to call this a game, nobody can refund the 23 minutes I spent playing this.","helpful_votes":2,"funny_votes":0,"reward":0,"gametime_record":0.4,"cleaned_text":"struggle call game nobody refund 23 minut spent play"}
{"thumbs_up":false,"text":"its fun, but the progressions is completely ♥♥♥♥♥♥. one round you can get to 30 minutes. the next you will quit manually before 10 because you dont have ♥♥♥♥ for abilities because everything is 100% random. you don't feel powerful unless you get really lucky on your level up skills. most of the game is repetitive garbage with zero progression. you will be doing the same 10 minutes over and over hundreds of times to get enough coins to upgrade, because  RNG will make sure you cant get the skills to get passed 10 minutes.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.8,"cleaned_text":"fun progress complete one round get 30 minut next quit manual 10 dont bail every 100 random dont feel power unless get really luck level skill game repeat garbage zero progress 10 minut under time get enough coin upgrade ng make sure cant get skill get pas 10 minut"}
{"thumbs_up":false,"text":"Too addictive I have not seen the sun in a year","helpful_votes":0,"funny_votes":3,"reward":0,"gametime_record":44.5,"cleaned_text":"addict seen sun year"}
{"thumbs_up":true,"text":"Yes.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":26.3,"cleaned_text":"yes"}
{"thumbs_up":true,"text":"---{ Graphics }---☐ You forget what reality is☐ Beautiful☑ Good☐ Decent☐ Bad☐ Don‘t look too long at it☐ MS-DOS---{ Gameplay }---☑ Very good☐ Good☐ It's just gameplay☐ Mehh☐ Watch paint dry instead☐ Just don't---{ Audio }---☐ Eargasm☐ Very good☑ Good☐ Not too bad☐ Bad☐ I'm now deaf---{ Audience }---☑ Kids☑ Teens☑ Adults☑ Grandma---{ PC Requirements }---☑ Check if you can run paint☐ Potato☐ Decent☐ Fast☐ Rich boi☐ Ask NASA if they have a spare computer---{ Difficulty }---☐ Just press 'W'☐ Easy☑ Easy to learn \/ Hard to master☐ Significant brain usage☐ Difficult☐ Dark Souls---{ Grind }---☐ Nothing to grind☐ Only if u care about leaderboards\/ranks☐ Isn't necessary to progress☑ Average grind level☐ Too much grind☐ You'll need a second life for grinding---{ Story }---☑ No Story☐ Some lore☐ Average☐ Good☐ Lovely☐ It'll replace your life---{ Game Time }---☐ Long enough for a cup of coffee☐ Short☐ Average☐ Long☑ To infinity and beyond---{ Price }---☐ It's free!☑ Worth the price☐ If it's on sale☐ If u have some spare money left☐ Not recommended☐ You could also just burn your money---{ Bugs }---☐ Never heard of☐ Minor bugs☑ Can get annoying☐ ARK: Survival Evolved☐ The game itself is a big terrarium for bugs---{ ? \/ 10 }---☐ 1☐ 2☐ 3☐ 4☐ 5☐ 6☐ 7☑ 8☐ 9☐ 10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.8,"cleaned_text":"graphic forget reality beauty good decent bad dont look long msds gameplay good good gameplay mesh watch paint doi instead dont audio sarcasm good good bad bad im deaf audience kid teen adult grand pc require check run paint potato decent fast rich boi ask nasa spare compute difficult press w east east learn hard master signifies brain usage difficult dark soul grind not grind u care leaderboardsrank isnt necessary progress average grind level much grind you need second life grind story story lore average good love till replace life game time long enough cup coffee short average long infin beyond price free worth price sale u spare money left recommend could also burn money bug never heard minor bug get annoy ark survive evolve game big terrorism bug 10 1 2 3 4 5 6 7 8 9 10"}
{"thumbs_up":false,"text":"It's good but people are way overhyping it. There are games that do the concept better; Vampire Survivors accessibility is ultimately what makes it attractive.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.9,"cleaned_text":"good people way overlap game concept better vampire survivor access ultima make attract"}
{"thumbs_up":true,"text":"I cant stop playing.. its been 12 years.. HELP","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":7.9,"cleaned_text":"cant stop play 12 year help"}
{"thumbs_up":true,"text":"Duh.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":813.1,"cleaned_text":"duh"}
{"thumbs_up":false,"text":"It's fun until it's instantly boring, like a bad drug addiction.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":48.5,"cleaned_text":"fun instant bore like bad drug addict"}
{"thumbs_up":false,"text":"This game used to be great. But the direction the dev is taking it is crap. Getting certain builds is almost impossible which makes it nigh impossible to beat certain stages. They herd you into getting certain weapons and items, cause if you dont use those specific ones you just die.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":458.1,"cleaned_text":"game use great direct dev take crap get certain build almost impose make high impose beat certain stage herd get certain weapon item cap dont use specify one die"}
{"thumbs_up":false,"text":"If you have joysticks plugged in, it'll constantly go left. This has been a bug since well before launch (saw a post form March 2022) and has not been addressed. The only fix is to unplug any accessory controllers you have, which is unacceptable. Why it hasn't been fixed is beyond me. Refunded shortly after posting this.","helpful_votes":0,"funny_votes":1,"reward":0,"gametime_record":0.2,"cleaned_text":"joystick plug till constant go left bug since well launch saw post form march 2022 address fix plug accessory control accept hasn fix beyond refund short post"}
{"thumbs_up":false,"text":"no NSFW content, even though you can play with one hand I wouldn't recommend.","helpful_votes":2,"funny_votes":7,"reward":0,"gametime_record":2.8,"cleaned_text":"nsw content even though play one hand wouldnt recommend"}
{"thumbs_up":false,"text":"Product received for freeThumbs down so that the algorithm will stop thinking I liked this game and will stop recommending me games that are \"similar to\".","helpful_votes":0,"funny_votes":3,"reward":0,"gametime_record":4.8,"cleaned_text":"product receive freethumb algorithm stop think like game stop recommend game similar"}
{"thumbs_up":false,"text":"Steam asked for review. I don't review or recommend anything. So NO it is.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":128.5,"cleaned_text":"steam ask review dont review recommend any"}
{"thumbs_up":true,"text":"Great game to pass the time. Love the random choices at leveling up, though it stinks when you don't get your favorite items to choose from.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":32.4,"cleaned_text":"great game pas time love random choice level though stink dont get favorite item choose"}
{"thumbs_up":true,"text":"Le funny dopamine game.For real though, this game is amazing. So much depth and complexity from such a small sized game. It's honestly a crime how little I paid for this game. Plus the soundtrack is a banger. Hope there is more content planned, even if there isn't I've thoroughly enjoyed this game and the experience I've had with it","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":42.8,"cleaned_text":"le funny dopamine gamer real though game ama much depth complex small size game honest crime little paid game plus soundtrack banner hope content plan even isnt ive thorough enjoy game expert ive"}
{"thumbs_up":true,"text":"Best game ever.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":168.8,"cleaned_text":"best game ever"}
{"thumbs_up":true,"text":"My boyfriend was like 'hey, wanna play a game on my pc'78 hours later I've got all achievements and unlocked every secret characterI never played games before, I got so addicted i bought my own gaming laptop just to play this game, I'm on a roll and there's no stopping me anymoreGreat game, very easy, extremely addictive","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":78.0,"cleaned_text":"boyfriend like hey wanna play game pc78 hour later ive got achieve unlock every secret character never play game got addict bought game laptop play game im roll there stop anymoregreat game east extreme addict"}
{"thumbs_up":true,"text":"Too addictive, I had to uninstall it before it ruined my life. Loved it, but I need sleep and to actually function as a human being.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":81.3,"cleaned_text":"addict unispal ruin life love need sleep actual function human"}
{"thumbs_up":true,"text":"Amazing game. Worth every penny. I'm not even into these types of games and this got me hoocked hard.Haven't encountered any bugs or issues myself.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":37.6,"cleaned_text":"ama game worth every penny im even type game got hook hardhav count bug issue"}
{"thumbs_up":true,"text":"This game is super fun! Just shut up and buy it! its cheap. Just buy it.  Trout for clout.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":11.9,"cleaned_text":"game super fun shut buy cheap buy trout clout"}
{"thumbs_up":true,"text":"fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":8.8,"cleaned_text":"fun"}
{"thumbs_up":true,"text":"One of thew best rogue-like games I've played;has a seemingly both a Castlevania atmosphere,and Robotron 2084 monsters mobbing to killone of 40 different characters.Would like to hope for a few more options though,such as save files, or reset game data to start overfor better replay potential.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":114.9,"cleaned_text":"one the best roguelik game ive played seem castlevania atmosphereand robotron 2084 monster mob tillon 40 differ characterswould like hope option thoughsuch save file reset game data start governor better replay potent"}
{"thumbs_up":true,"text":"It's addictive game. Before playing consult your doctor.","helpful_votes":0,"funny_votes":1,"reward":0,"gametime_record":37.7,"cleaned_text":"addict game play consult doctor"}
{"thumbs_up":true,"text":"Very simple, but also captivating game","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":3.5,"cleaned_text":"simply also captive game"}
{"thumbs_up":true,"text":"h2stop","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":52.6,"cleaned_text":"h2stop"}
{"thumbs_up":true,"text":"Very fun, very addictive.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":17.6,"cleaned_text":"fun addict"}
{"thumbs_up":true,"text":"Really fun game, lots of cool stuff to do 👍","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":32.2,"cleaned_text":"really fun game lot cool stuff"}
{"thumbs_up":true,"text":"This is more fun than a lot of AAA titles.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":60.5,"cleaned_text":"fun lot aaa title"}
{"thumbs_up":true,"text":"Best 5 bucks I spent in a while, there's literally SO MUCH CONTENT and replay-ability its crazy. Amazing game I absolutely loved it.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":30.6,"cleaned_text":"best 5 buck spent there liter much content replay crazy ama game absolute love"}
{"thumbs_up":true,"text":"This game makes me happy","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":9.9,"cleaned_text":"game make happy"}
{"thumbs_up":true,"text":"Very addictive. Great chillout game and amazing with podcasts.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":13.5,"cleaned_text":"addict great chillout game ama podcast"}
{"thumbs_up":true,"text":"i don't remember playing this long","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":12.4,"cleaned_text":"dont remember play long"}
{"thumbs_up":true,"text":"I got this for like 50 cents yeaah","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":1.6,"cleaned_text":"got like 50 cent yeah"}
{"thumbs_up":true,"text":"nice","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":8.8,"cleaned_text":"nice"}
{"thumbs_up":true,"text":"g","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":14.0,"cleaned_text":"g"}
{"thumbs_up":true,"text":"You will never spend less on a game this fun. I have enjoy every second I've put into this game. It's constantly adding new things as soon as you what is available gets stale. Always something new and interesting and fun just beyond the next run or two. One of the only games I've ever cared about getting achievements in. Simple but deep. One of the best games to come out in 2022 literally only second to Elden Ring.Dirt cheap, endlessly enjoyable, Devs that constantly give free new content, care about the players and deserve your money.Worth evey penny. Do yourself a favor, pick this up.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":114.9,"cleaned_text":"never spend le game fun enjoy every second ive put game constant ad new thing soon avail get stale away some new interest fun beyond next run two one game ive ever care get achieve simply deep one best game come 2022 liter second elder ringdirt cheap endless enjoy dev constant give free new content care player desert moneyworth even penny favor pick"}
{"thumbs_up":true,"text":"addictive game. Just one more round...","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":93.1,"cleaned_text":"addict game one round"}
{"thumbs_up":true,"text":"10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":33.4,"cleaned_text":"10"}
{"thumbs_up":true,"text":"Probably one of the few games I've played where I enjoyed grinding to get specific characters. The cost for this game alone is amazing and the concept is easy to pick up and play. Please give it a shot when you get a chance","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":60.5,"cleaned_text":"probably one game ive play enjoy grind get specify character cost game along ama concept east pick play plea give shot get chance"}
{"thumbs_up":true,"text":"Best 5 dollar game I have ever played10\/10 (considering the price)","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":38.2,"cleaned_text":"best 5 dollar game ever played1010 consider price"}
{"thumbs_up":true,"text":"addicting","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":56.0,"cleaned_text":"addict"}
{"thumbs_up":true,"text":"It's ok I guess. If you're into that sort of thing.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":59.3,"cleaned_text":"ok guess your sort thing"}
{"thumbs_up":true,"text":"Easy review. It's the best. Awesome gameplay. Awesome value. Buy it.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":33.9,"cleaned_text":"east review best awesome gameplay awesome value buy"}
{"thumbs_up":true,"text":"addictive af, might loose friends from being days home playing it but still fun!>> buy it<<","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.6,"cleaned_text":"addict af might loss friend day home play still fun buy"}
{"thumbs_up":true,"text":"Simple and addicting.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":31.5,"cleaned_text":"simply addict"}
{"thumbs_up":true,"text":"God tier indie game for 5 bucks? Yes please!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":71.4,"cleaned_text":"god tier india game 5 buck yes plea"}
{"thumbs_up":true,"text":"So awesome.  It seems silly for a moment, and then you're 100 hours in and still unlocking stuff.  Loving it.","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":405.7,"cleaned_text":"awesome seem silly moment your 100 hour still unlock stuff love"}
{"thumbs_up":true,"text":"Amazing game especially for the price. Can not recommend it enough!","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":23.0,"cleaned_text":"ama game respect price recommend enough"}
{"thumbs_up":true,"text":"great rougelike shooter. have played for hours on here and the mobile version","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":79.7,"cleaned_text":"great rougelik shooter play hour mobil version"}
{"thumbs_up":true,"text":"Why can't I stop playing!? YAMN you team poncle!! love ya :)","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":45.3,"cleaned_text":"cant stop play damn team ponce love ya"}
{"thumbs_up":true,"text":"Super solid gameplay. Fun game loop, great for those who are wanting to optimize the fun right out of a game.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":110.3,"cleaned_text":"super solid gameplay fun game loop great want optic fun right game"}
{"thumbs_up":true,"text":"Best value for money ever","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":39.3,"cleaned_text":"best value money ever"}
{"thumbs_up":true,"text":"Super addictive, you just want to play ONE more game each time to unlock the next item\/character\/etc. Don't let the graphics fool you, this has more depth than meets the eye and is very fun!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":25.0,"cleaned_text":"super addict want play one game time unlock next itemcharacteretc dont let graphic fool depth meet eye fun"}
{"thumbs_up":true,"text":"Honestly way more fun and addicting than most AAA games that come out these days.  Very fun to go for all the characters, unlocks, and achievements.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":30.8,"cleaned_text":"honest way fun addict aaa game come day fun go character unlock achieve"}
{"thumbs_up":true,"text":"I didn't think this game would really be for me, but took a chance on it since it was so cheap. I am incredibly glad I did! The game is so addictive and the short levels have you constantly saying \"just one more\".","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":46.2,"cleaned_text":"didnt think game would really took chance since cheap injured glad game addict short level constant say one"}
{"thumbs_up":true,"text":"THE MEAT GRINDERIT HUNGERS FOR MORE FLESHREEKS OF DEATH AND DECAYBIDES IT TIMEOFFERS DOPAMINE SUCCOR IN EXCHANGETHUS PACT IS SEALED","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":9.0,"cleaned_text":"meat grinder hunger fleshreek death decayed takeoff dopamine soccer exchangethus pact seal"}
{"thumbs_up":true,"text":"9\/11Fun to figure out how everything unlocks.Progression is nice.Once you max out, you steamroll everything.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":47.9,"cleaned_text":"911fun figure every unlocksprogress niceonc max steamrol every"}
{"thumbs_up":true,"text":"Game where for the first few hours you run away from everything. After that you run into everything.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":91.2,"cleaned_text":"game first hour run away every run every"}
{"thumbs_up":true,"text":"Bro its really fun, well done and the perfect game to play as much or as little as you want. It never disappoints.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":21.0,"cleaned_text":"bro really fun well done perfect game play much little want never disappoint"}
{"thumbs_up":true,"text":"The fun to dollar ratio is absurd. Absurd. Bag of chips? Fancy coffee? Or this game. Choose this game.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":6.6,"cleaned_text":"fun dollar ratio absurd absurd bag chip fancy coffee game choose game"}
{"thumbs_up":true,"text":"Indie goty 2022","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":102.2,"cleaned_text":"india got 2022"}
{"thumbs_up":true,"text":"This game is crack","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":10.3,"cleaned_text":"game crack"}
{"thumbs_up":true,"text":"Fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":34.1,"cleaned_text":"fun"}
{"thumbs_up":true,"text":"F**king addictive game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":7.4,"cleaned_text":"king addict game"}
{"thumbs_up":true,"text":"gg","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":20.4,"cleaned_text":"gg"}
{"thumbs_up":true,"text":"Brilliant gameplay loop. Love the pixel art aesthetics. My only criticism would be the menu layout, it could be cleaner and more intuitive. Regardless, I definitely recommend this game to anyone that loves rouguelites and Castlevania.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":8.5,"cleaned_text":"brilliant gameplay loop love pixel art aesthetic critic would menu layout could cleaner input regardless deficit recommend game anyone love rouguelit castlevania"}
{"thumbs_up":true,"text":"Lots of ♥♥♥♥ going on very stimulating 10\/10 would recommend","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":383.7,"cleaned_text":"lot go stimulus 1010 would recommend"}
{"thumbs_up":true,"text":"I can see the orbs when I close my eyes","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":23.0,"cleaned_text":"see orb close eye"}
{"thumbs_up":true,"text":"Actually enoyable and a bit addictive, despite what graphics suggest. :D","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":22.0,"cleaned_text":"actual enjoy bit addict despite graphic suggest"}
{"thumbs_up":true,"text":"Why are you down here looking at reviews?Are you looking for something?...You're STILL looking?","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":78.7,"cleaned_text":"look review look somethingyour still look"}
{"thumbs_up":true,"text":"Fun and addicting game play that lets you jump in and out as much as you want and when you want with out missing a beat.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":62.9,"cleaned_text":"fun addict game play let jump much want want miss beat"}
{"thumbs_up":true,"text":"Unbelievably fun! This game was made with love.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":9.9,"cleaned_text":"unbeliev fun game made love"}
{"thumbs_up":true,"text":"Heroine.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":95.6,"cleaned_text":"heroin"}
{"thumbs_up":true,"text":"Vampire Survivors takes a bit to get going. For me, it's when the harder stages come in, you think you have the perfect combination of weapons all ready, then you get steamrolled. The game encourages you to get better by studying your own weaknesses because each weapon and accessory is so versatile with one another. It's that satisfaction of finding the next powerful tool to experiment with and bringing it into your play style that makes the game incredibly addicting. I appreciate those types of games where so many variables can affect the gameplay and tinker with so many tools to make yourself better. Would I recommend? Absolutely. Has a ton of content to unlock, plenty of tools and roguelike elements to mix it up, achievements. It's a masterclass of a game!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":47.6,"cleaned_text":"vampire survivor take bit get go harder stage come think perfect combine weapon read get steamrol game encourage get better studi weak weapon accessory versatile one not satisfact find next power tool expert bring play style make game injured addict appreci type game mani variable affect gameplay tanker mani tool make better would recommend absolute ton content unlock plenty tool roguelik element mix achieve masterclass game"}
{"thumbs_up":true,"text":"game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":8.6,"cleaned_text":"game"}
{"thumbs_up":true,"text":"its good","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":54.2,"cleaned_text":"good"}
{"thumbs_up":true,"text":"addictive","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.1,"cleaned_text":"addict"}
{"thumbs_up":true,"text":"variety","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":15.7,"cleaned_text":"variety"}
{"thumbs_up":true,"text":"yes","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":44.3,"cleaned_text":"yes"}
{"thumbs_up":true,"text":"Extremely addictive.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":56.9,"cleaned_text":"extreme addict"}
{"thumbs_up":true,"text":"BUY IT ITS GOOD","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.7,"cleaned_text":"buy good"}
{"thumbs_up":true,"text":"Good","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.4,"cleaned_text":"good"}
{"thumbs_up":true,"text":"Literally crack","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.2,"cleaned_text":"liter crack"}
{"thumbs_up":true,"text":"omg best game ever 😍😍","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":47.3,"cleaned_text":"omg best game ever"}
{"thumbs_up":true,"text":"game has no right being this addictive","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":45.1,"cleaned_text":"game right addict"}
{"thumbs_up":true,"text":"very good","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":66.3,"cleaned_text":"good"}
{"thumbs_up":true,"text":"funny game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.2,"cleaned_text":"funny game"}
{"thumbs_up":true,"text":"This feels like a game I'd come to at any time in life.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.5,"cleaned_text":"feel like game id come time life"}
{"thumbs_up":true,"text":"This game ruined my life","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":30.6,"cleaned_text":"game ruin life"}
{"thumbs_up":true,"text":"garlic","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":6.0,"cleaned_text":"garlic"}
{"thumbs_up":true,"text":"Didn't see any vampires. Didn't survive. 5\/5 would die again.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":86.0,"cleaned_text":"didnt see vampire didnt survive 55 would die"}
{"thumbs_up":true,"text":"Great game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":59.8,"cleaned_text":"great game"}
{"thumbs_up":true,"text":"garlic better than sex","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":140.8,"cleaned_text":"garlic better sex"}
{"thumbs_up":true,"text":"super addicting! In a good way.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.4,"cleaned_text":"super addict good way"}
{"thumbs_up":true,"text":"Best game ever","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":7.2,"cleaned_text":"best game ever"}
{"thumbs_up":true,"text":"Addictive and just so many builds to go after!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":46.6,"cleaned_text":"addict mani build go"}
{"thumbs_up":true,"text":"100 hours passed and i have no idea what happened. 7\/10 fun game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":138.4,"cleaned_text":"100 hour pas idea happen 710 fun game"}
{"thumbs_up":true,"text":"very fun roguelike fun endgame lots of abilities and fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":57.8,"cleaned_text":"fun roguelik fun endgame lot bail fun"}
{"thumbs_up":true,"text":"BOOM BOOM SWISH SWISH SWISH BLAMMMMMthis game is crack for me, i cant get enough","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":89.6,"cleaned_text":"boom boom wish wish wish blammmmmthi game crack cant get enough"}
{"thumbs_up":true,"text":"Love this game and its surprising depth, tons of people to choose from, cool item system, and different ways to play.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.1,"cleaned_text":"love game surprise depth ton people choose cool item system differ way play"}
{"thumbs_up":true,"text":"Pretty fun.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":55.4,"cleaned_text":"pretty fun"}
{"thumbs_up":true,"text":"I think I download the wrong Holocure :^)","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":9.0,"cleaned_text":"think download wrong colour"}
{"thumbs_up":true,"text":"♥♥♥♥♥♥♥ INCREDIBLE","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.7,"cleaned_text":"injured"}
{"thumbs_up":true,"text":"Wow this game is ugly and is so incredibly basic how could it be fun... ...... ... ... Why is my wake-up alarm going off? Wait its tomorrow???","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":73.7,"cleaned_text":"wow game ugly injured basic could fun makeup alarm go wait tomorrow"}
{"thumbs_up":true,"text":"awesome game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":16.1,"cleaned_text":"awesome game"}
{"thumbs_up":true,"text":"Kinda addicting^^","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":10.2,"cleaned_text":"kinda addict"}
{"thumbs_up":true,"text":"Fun game to just sit and play for a little bit when you don't have much to do.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":8.5,"cleaned_text":"fun game sit play little bit dont much"}
{"thumbs_up":true,"text":"Its like a slot machine but you win something every time you level up. Then you win something every time you win something. Next thing you know you are the eye of a storm amidst a throng of all kinds of horrors who just want to touch you and your next thought is, \"What lies beyond?\". All of this with the irony that your controls are W, S, A and D.The ultimate dopamine experience.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.9,"cleaned_text":"like slot machine win some every time level win some every time win some next thing know eye storm amidst throne kind horror want touch next thought lie beyond iron control w the ultima dopamine expert"}
{"thumbs_up":true,"text":"Fun game to play casually and chill when i'm not playing more demanding stuff. 10\/10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.6,"cleaned_text":"fun game play casual chill im play demand stuff 1010"}
{"thumbs_up":true,"text":"pretty cool","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":26.3,"cleaned_text":"pretty cool"}
{"thumbs_up":true,"text":"Gives me that Tetris effect. Soothing... puts me in a trance. I didn't expect to like this game!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":147.6,"cleaned_text":"give tetra effect south put trans didnt expect like game"}
{"thumbs_up":true,"text":"Nice game to use the free time you have with. Just started some days ago with my job and after i come home from work this game is perfect to chill out and dont think.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":34.5,"cleaned_text":"nice game use free time start day ago job come home work game perfect chill dont think"}
{"thumbs_up":true,"text":"Fun and quite addictive","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":74.3,"cleaned_text":"fun quit addict"}
{"thumbs_up":true,"text":"Si, piola","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":59.1,"cleaned_text":"si viola"}
{"thumbs_up":true,"text":"I feel like my story has already been told. I avoided this game for a bit because it just didn't look all that interesting in spite of lots of people saying great things about it. I should've listened. It makes my brain do nice things with happy chemicals. Move around, make choices, and don't die. Very simple, very addicting.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":23.6,"cleaned_text":"feel like story already told avoid game bit didnt look interest spite lot people say great thing should listen make brain nice thing happy chemin move around make choice dont die simply addict"}
{"thumbs_up":true,"text":"Its great.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":37.9,"cleaned_text":"great"}
{"thumbs_up":true,"text":"good game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":102.5,"cleaned_text":"good game"}
{"thumbs_up":true,"text":"i can dig it","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":28.1,"cleaned_text":"dig"}
{"thumbs_up":true,"text":"Fun game.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":17.1,"cleaned_text":"fun game"}
{"thumbs_up":true,"text":"This is the most amazing thing you will ever play once it clicks.  It's just the most ridiculous dopamine rush a single human being can ever play.It's a top-down roguelike with a character of your choice that you move around an infinite plain, all while building your loadout to turn you into an unruly, GPU-slowing instrument of death as you mow down hundreds of thousands of enemies en route to pure satisfaction.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":13.1,"cleaned_text":"ama thing ever play click ridicule dopamine rush single human ever player topdoc roguelik character choice move around infinite plain build layout turn unruly gpuslow instrument death row under thousand enemy en rout pure satisfact"}
{"thumbs_up":true,"text":"So good, so simple. Love it.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":29.9,"cleaned_text":"good simply love"}
{"thumbs_up":true,"text":"neuron activation","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":10.5,"cleaned_text":"neuron active"}
{"thumbs_up":true,"text":"Probably","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":171.3,"cleaned_text":"probably"}
{"thumbs_up":true,"text":"ok, so the hype was right","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":11.5,"cleaned_text":"ok hype right"}
{"thumbs_up":true,"text":"You can play many hours without being bored, I usually play while listening to a podcast :D. Great game !","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.7,"cleaned_text":"play mani hour without bore usual play listen podcast great game"}
{"thumbs_up":true,"text":"haha dopamine go brrralso peachone\/ebony wings\/vandalier ROCK in this game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.8,"cleaned_text":"haha dopamine go brrralso peachoneeboni wingsvandali rock game"}
{"thumbs_up":true,"text":"never thought i would love garlic so much","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.7,"cleaned_text":"never thought would love garlic much"}
{"thumbs_up":true,"text":"Game of the year! Brilliantly simple and addictive just-one-more-run engine. Could've been developed on DOS in 1992 and that's kinda why it's great.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":27.8,"cleaned_text":"game year brilliant simply addict justonemorerun engine could develop do 1992 that kinda great"}
{"thumbs_up":true,"text":"w","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":38.8,"cleaned_text":"w"}
{"thumbs_up":true,"text":"Time Melter","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":14.4,"cleaned_text":"time meter"}
{"thumbs_up":true,"text":"help","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":31.1,"cleaned_text":"help"}
{"thumbs_up":true,"text":"sheeeeeeeeeeeeeeeeeeesh","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":21.0,"cleaned_text":"sheeeeeeeeeeeeeeeeeeesh"}
{"thumbs_up":true,"text":"♥♥♥♥ this game","helpful_votes":0,"funny_votes":1,"reward":0,"gametime_record":11.0,"cleaned_text":"game"}
{"thumbs_up":true,"text":"the only game where lagging = winning","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":14.7,"cleaned_text":"game lag win"}
{"thumbs_up":true,"text":"The game that made survivor games popular.Got it for 3$ on a whim, 100% worth it. Lots of content and easy to shut your mind off and watch the pixels on the screen do there work.100% reccomend","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":15.6,"cleaned_text":"game made survivor game populargot 3 whim 100 worth lot content east shut mind watch pixel screen work100 recommend"}
{"thumbs_up":true,"text":"Very good game!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":51.1,"cleaned_text":"good game"}
{"thumbs_up":true,"text":"Why is this game great? It has controller support. I just saw 3 clones on this variation released this month, and we're only 4 days in. None have controller support. Some actually seem better. Developers these days are just lazy. To you lazy developers that are trying to hop on the bandwagon, don't be lazy and offer controller support. I want to lean back in my office chair, drink coffee, and listen to the news while playing a game. Nobody wants to be hunched over these days. No wonder coccyx cushions are a huge seller. RANT OVER!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":20.9,"cleaned_text":"game great control support saw 3 clone variant release month 4 day none control support actual seem better develop day lazy lazy develop tri hop bandwagon dont lazy offer control support want lean back office chair drink coffee listen news play game nobody want bunch day wonder coccyx cushion huge seller rant"}
{"thumbs_up":true,"text":"I've barely scratched the surface, I just keep playing the first level and have a blast.Really addictive Game play loop. There's no story, love that, just lemme play the game.Good drip feed of achievements and challenges to do, they all drop at the end of a run for a nice big hit of dopamine.The games perfect, 10\/10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":18.4,"cleaned_text":"ive bare scratch surface keep play first level blastreal addict game play loop there story love lemma play gamegood drip feed achieve challenge drop end run nice big hit dopamine game perfect 1010"}
{"thumbs_up":true,"text":"kill... them... all!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.1,"cleaned_text":"kill"}
{"thumbs_up":true,"text":"Best 5$ you can spend on steam. MUST HAVE !","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":104.1,"cleaned_text":"best 5 spend steam must"}
{"thumbs_up":true,"text":"Its a Drug","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":10.4,"cleaned_text":"drug"}
{"thumbs_up":true,"text":"game is ass but i like it","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":43.9,"cleaned_text":"game as like"}
{"thumbs_up":true,"text":"very addictive!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":89.3,"cleaned_text":"addict"}
{"thumbs_up":true,"text":"lots of vampires be care full","helpful_votes":1,"funny_votes":0,"reward":0,"gametime_record":56.7,"cleaned_text":"lot vampire care full"}
{"thumbs_up":true,"text":"vamper surivor","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":6.9,"cleaned_text":"hamper survivor"}
{"thumbs_up":true,"text":"Awesome game, played it on my phone as soon as it was released, brings back the nostalgia in a big way, recommended","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.6,"cleaned_text":"awesome game play phone soon release bring back nostalgia big way recommend"}
{"thumbs_up":true,"text":"very funb","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":12.1,"cleaned_text":"fund"}
{"thumbs_up":true,"text":"Good game.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.2,"cleaned_text":"good game"}
{"thumbs_up":true,"text":"Cheap, very fun game. Great soundtrack.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":71.2,"cleaned_text":"cheap fun game great soundtrack"}
{"thumbs_up":true,"text":"Be The Bullet HellVampire Survivors is amazing with lots of replay-ability. There are even secrets in the game such as hidden characters with unique abilities.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":63.1,"cleaned_text":"bullet hellvampir survivor ama lot replay even secret game hidden character unique bail"}
{"thumbs_up":true,"text":"Addicting and fun (My playtime is low cause I mostly play on phone during work breaks)","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":6.0,"cleaned_text":"addict fun plastic low cap most play phone work break"}
{"thumbs_up":true,"text":"Was thinking for a moment and realised that I really should leave a review for this game. I’ll explain why.Got this game a while ago when a lot of stuff was still not there yet. And it was already a really good game to play on pc. Controls felt really good, weapons nice to use and fairly balanced, cool interaction between some of them and eventually some you could combine. Especially on controller it’s great to play. Keyboard works too but you get better directional control with the joystick so id recommend doing that if possible.Later I got my steam deck, that turned this game into the best portable game I ever owned. Even at home I’d rather grab my steam deck to play this then my desktop. I can’t explain why. It just is prefect for that.At the start already but even more so now that a lot more has been added. This is a surprisingly worked out game. At the start it seems very basic. You move around that’s all you do. The rest is automatic. Yet with just that it still manages to do so much. You unlock weapons, maps, different modes, and depending on how much you look up figure out how everything works yourself. I’d personally recommend not looking stuff up, especially at the start. It’s really cool going through the game and learning what stuff combines together end how everything works.The game is challenging too, at the start I’d really not expect to win. You’ll need a few runs to figure out how to survive and what to prioritise and when. As you do this you’ll also unlock some permanent upgrades that are well balanced in a way that doesn’t make it feel like you’re OP. But mostly just makes any of the more annoying parts about restarting more convenient and keeps it fun to constantly replay.But now why I had to review this. It may not be the best game in my library, it’s not the best looking one or the one I have the most hours on. But it’s one of the only games I own at this price. And with that price its by far the best value for money game I’ve ever bought. And its not even close either. Its so far above anything else in that that I doubt anything will replace that spot in years if at all.The maker of this game could have sold the game for 30 bucks if he wanted. I’m sure it would have sold at that price and still had good reviews. But he didn’t. And not just that, but he also released a dlc that again he could have easily made 15 bucks at least. But again it’s cheaper then a coffee.I appreciate that a lot, many people would have gone for it. But by not doing that I think this game just put itself in a spot that I’d never forget it.This probably is the only game in my library I’d give a proper 10\/10 with no criticism I can give about the game. It’s perfect.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":67.9,"cleaned_text":"think moment realism really lead review game ill explain whygot game ago lot stuff still yet already really good game play pc control felt really good weapon nice use fair balance cool interact event could combine respect control great play keyboard work get better direct control joystick id recommend possiblelat got steam deck turn game best portal game ever own even home id rather grab steam deck play desktop cant explain prefect that start already even lot ad surprise work game start seem basic move around that rest automaton yet still manga much unlock weapon map differ mode depend much look figure every work id person recommend look stuff respect start really cool go game learn stuff combine together end every work game challenge start id really expect win you need run figure survive priority you also unlock german upgrade well balance way doesnt make feel like your op most make annoy part restart convent keep fun constant replaybut review may best game library best look one one hour one game price price far best value money game ive ever bought even close either far any el doubt any replace spot year all maker game could sold game 30 buck want im sure would sold price still good review didnt also release dlc could easily made 15 buck least cheaper coffee appreci lot mani people would gone think game put spot id never forget ichi probably game library id give proper 1010 critic give game perfect"}
{"thumbs_up":true,"text":"After one round I can tell this will always be a fun time filler; it scratches that arcade itch.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":0.3,"cleaned_text":"one round tell away fun time filler scratch arcade itch"}
{"thumbs_up":true,"text":"Insane replay value.Buying this game is equal to buying dopamine. Buy it already and you will have dopamine supply for life.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":35.3,"cleaned_text":"insane replay valuebuy game equal buy dopamine buy already dopamine supply life"}
{"thumbs_up":true,"text":"must have in every library","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.9,"cleaned_text":"must every library"}
{"thumbs_up":true,"text":".ʞɔɒɿɔ lɒυɈɿiv ƨi ɘmɒϱ ƨiʜT","helpful_votes":0,"funny_votes":1,"reward":0,"gametime_record":66.8,"cleaned_text":"liv"}
{"thumbs_up":true,"text":"fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":10.6,"cleaned_text":"fun"}
{"thumbs_up":true,"text":"You know those pictures of old folks sitting at slot machines in Vegas not moving for hours...this is that in game form. shiny things, quick fixes. £4 is a lot cheaper than a gambling addiction.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":9.3,"cleaned_text":"know picture old folk sit slot machine vega move hoursthi game form shine thing quick fix 4 lot cheaper gamble addict"}
{"thumbs_up":true,"text":"this is one of the best rogue-like indie arcade game with loads of content and a challenging fight against hoards of monsters chasing you in multiple different levels with multiple different abilities, upgrades, and characters+ gameplay is super fun and there is loads of content to never get bored of+ the game is pretty fair but very challenging at the same time+ small game any pc can run and download without busting the storage or the computr itself+ worth every penny amazing price for wat u get there are games like this that make u pay 3x more and are worse+ controller suppor+ supa cool soundtrack 😎- addicting im trying to enjoy life not vampiring the surviving- no vampire L scammer get scammed 👿👿👿👿- has a very annoying issue with the fullscreen where it bugs out idk happens to be alotSOUPA HIGHLY RECOMMEND no matter wat games u r into im not really into games like this at all but dis something else and idk but when it go on sale its like pennies but idk prob false info","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":2.6,"cleaned_text":"one best roguelik india arcade game load content challenge fight hoard monster chase multiple differ level multiple differ bail upgrade character gameplay super fun load content never get bore game pretty fair challenge time small game pc run download without bust storage computer worth every penny ama price wat u get game like make u pay 3x work control support sup cool soundtrack addict im tri enjoy life vampire survive vampire l spammer get scam annoy issue fullscreen bug id happen alotsoupa high recommend matter wat game u r im really game like dis some el id go sale like penny id pro false info"}
{"thumbs_up":true,"text":"awesome game, fun to play while listening to podcasts and stuff","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":37.9,"cleaned_text":"awesome game fun play listen podcast stuff"}
{"thumbs_up":true,"text":"Got scammed! Couldn't find VAMPIRE","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":30.5,"cleaned_text":"got scam couldnt find vampire"}
{"thumbs_up":true,"text":"fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":14.9,"cleaned_text":"fun"}
{"thumbs_up":true,"text":"It's the game Blizzard has been trying to make and failed for year. Pure dopamine machine. A demonstration in game design of mechanics that are inherently inelegant yet very powerful, saved by the actually elegant way it's wrapped up.I usually consider that game that doesn't let you make informed decisions until they punished you first are horrible, but I'll make an exception for this one. See, there is *so little to do* while you're showered in dopamine that it kinda makes sense that figuring what you're supposed to do is the actual game.It doesn't hurt that the text are quite funny, brining a great vibe to the whole thing.Very addictive though. As far as dopamine dispenser go in games, this is the hard stuff. Beware.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":37.7,"cleaned_text":"game blizzard tri make fail year pure dopamine machine demon game design meghan inner inlet yet power save actual leg way wrap upi usual consider game doesnt let make inform deck punish first horrible ill make except one see little your shower dopamine kinda make sen figure your suppose actual gameid doesnt hurt text quit funny brine great vibe whole thingveri addict though far dopamine dispense go game hard stuff bear"}
{"thumbs_up":true,"text":"Epilepsi uyarısına dikkat!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.0,"cleaned_text":"epilepsy uyarsna mikka"}
{"thumbs_up":true,"text":"Really good.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.0,"cleaned_text":"really good"}
{"thumbs_up":true,"text":"Good","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":6.8,"cleaned_text":"good"}
{"thumbs_up":true,"text":"How the ♥♥♥♥ is this game so much fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.7,"cleaned_text":"game much fun"}
{"thumbs_up":true,"text":"Civilization's \"One More Turn\" has long been a famous (or infamous) standard by which certain games can easily just make the hours fly on by.Vampire Survivors has managed to meet, or dare I say, surpass that insanely high standard. This game may look to a unknowing person about as deep as a puddle at first glance, but make no mistake it is in fact a dread abyss deeper then the Mariana Trench, and if you are not careful, there will be no escape.The amount of customization and possible builds beggars belief and that is before later mechanics unlock. The sense of power progression is rewarding as you learn and adapt. You will, at first be in situations that are frequently called \"bullet hell\"When you have learned, you will have found you are the \"bullet hell.\"In the year that saw the grandeur that is Elden Ring release, Vampire Survivors made a very strong case of runner up GOTY due to its absolute perfection of game play.I very much recommend giving it a try, just be sure your schedule for the immediate future is clear.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":63.9,"cleaned_text":"civil one turn long famous info standard certain game easily make hour fli byvampir survivor manga meet dare say surpass insane high standard game may look unknown person deep pull first glance make mistake fact dread abyss deeper marina trench care escape amount custom possible build beggar belief later meghan unlock sen power progress reward learn adapt first stat frequent call bullet hellwhen learn found bullet hellip year saw grandeur elder ring release vampire survivor made strong case runner got due absolute perfect game play much recommend give tri sure schedule immer future clear"}
{"thumbs_up":true,"text":"First impression is that it's just another one of those \"roguelite-ish mobile horde killer games\" of the genre I don't think has an official name. Second impression is that I'm not seeing any weapon combos, which is a really bad sign. Haven't played enough yet to give it a solid yes or no. Will write a better review after more time.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":0.4,"cleaned_text":"first impress not one rogueliteish mobil word killer game genre dont think office name second impress im see weapon combo really bad sign havent play enough yet give solid yes write better review time"}
{"thumbs_up":true,"text":"Best little big game I played in all of 2022! Looking forward to what 2023 brings for Vampire Survivors!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":55.6,"cleaned_text":"best little big game play 2022 look forward 2023 bring vampire survivor"}
{"thumbs_up":true,"text":"Only game I've ever fully completed. This game is just pureaddictinggames.com","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":53.0,"cleaned_text":"game ive ever full complete game pureaddictinggamescom"}
{"thumbs_up":true,"text":"this game is like doing drugs","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":45.3,"cleaned_text":"game like drug"}
{"thumbs_up":true,"text":"This game...is quite good.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":15.4,"cleaned_text":"game quit good"}
{"thumbs_up":true,"text":"very addictive","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":9.0,"cleaned_text":"addict"}
{"thumbs_up":true,"text":"the only roguelike that i can be bothered with","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":16.2,"cleaned_text":"roguelik bother"}
{"thumbs_up":true,"text":"Spoiler","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":116.0,"cleaned_text":"spoiler"}
{"thumbs_up":true,"text":"Didnt expect to like it but i am addicted","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":44.2,"cleaned_text":"didnt expect like addict"}
{"thumbs_up":true,"text":"Excellent time sink! more than worth the cost of admission, If you even only get a couple hours of fun out of it! Would try to go in \"blind\" and figure out stuff on your own.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":33.4,"cleaned_text":"excel time sink worth cost admins even get couple hour fun would tri go blind figure stuff"}
{"thumbs_up":true,"text":"Super fun Rogue-like. At first I was like \"who tf wants to play a game where you don't fire the weapons,\" still super addicting. still awesome.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":27.0,"cleaned_text":"super fun roguelik first like tf want play game dont fire weapon still super addict still awesome"}
{"thumbs_up":true,"text":"Deceptively excellent. I, like most people, took one look at the gameplay and immediately decided it wasn't a game for me and that it wasn't worth the money, let alone the time. I wouldn't have given it a second glance if a friend hadn't personally told me to give it a try.Three hours later and I'm helplessly hooked.My advice to anyone considering this game is to play it for 30 minutes. If your first impressions were spot-on, you can refund it. But if you're anything like me (and most of the people in these reviews), you'll pass your refund window before you even know it and you'll have no complaints about that fact.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.7,"cleaned_text":"decent excel like people took one look gameplay immer decide wasnt game wasnt worth money let along time wouldnt given second glance friend hadn person told give trythre hour later im helpless hooked advice anyone consider game play 30 minut first impress spoon refund your any like people review you pas refund window even know you complaint fact"}
{"thumbs_up":true,"text":"This game is addictive!very fun and not boring at all. does have cheats to give you a little help early although you don't need them :)Deserve GOTY for real!!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.0,"cleaned_text":"game addictiveveri fun bore cheat give little help early although dont need desert got real"}
{"thumbs_up":true,"text":"Kind of mindless fun, but fun nonetheless. Really addictive!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":47.8,"cleaned_text":"kind mindless fun fun nonetheless really addict"}
{"thumbs_up":true,"text":"A great game where you walk in circles and min-max powerups, over and over again. Buy power-ups, min-max some more. Buy new characters. Min-max some more. More. More. More.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":51.7,"cleaned_text":"great game walk circle minimal power buy power minimal buy new character minimal"}
{"thumbs_up":true,"text":"My rule separating \"game\" and \"gambling\/gacha\" is \"you only pay once.\" Simple rule, never broke it.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":135.8,"cleaned_text":"rule spear game gamblinggacha pay simply rule never broke"}
{"thumbs_up":true,"text":"One of the best priced games on Steam.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":32.8,"cleaned_text":"one best price game steam"}
{"thumbs_up":true,"text":"veri gud","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":24.8,"cleaned_text":"very gun"}
{"thumbs_up":true,"text":"10\/10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":15.1,"cleaned_text":"1010"}
{"thumbs_up":true,"text":"If you drop the game the first time you played it, pick it back up and reconsider. That's what I did.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":16.1,"cleaned_text":"drop game first time play pick back reconsider that"}
{"thumbs_up":true,"text":"Dopamine farm at it's best","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":73.1,"cleaned_text":"dopamine farm best"}
{"thumbs_up":true,"text":"It's good.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":10.3,"cleaned_text":"good"}
{"thumbs_up":true,"text":"Very fun and addictive can play for hours","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":6.7,"cleaned_text":"fun addict play hour"}
{"thumbs_up":true,"text":"not many better ways to spend 5 bucks","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":7.1,"cleaned_text":"mani better way spend 5 buck"}
{"thumbs_up":true,"text":"Become Monkee and afk","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":155.5,"cleaned_text":"become monk afd"}
{"thumbs_up":true,"text":"Vampire Survivors is like smoking. You regret ever starting in the first place but look forward to each time you got a few minutes to have a puff.Is it killing also you slowly? Probably not. Probably.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":41.7,"cleaned_text":"vampire survivor like smoke regret ever start first place look forward time got minut puff kill also slowly probably probably"}
{"thumbs_up":true,"text":"Probably the best bang for your buck game ever. Many many hours of content, and it's dirt cheap!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":71.1,"cleaned_text":"probably best bang buck game ever mani mani hour content dirt cheap"}
{"thumbs_up":true,"text":"slays. perfect for passing time and feeling strong.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":250.5,"cleaned_text":"slay perfect pas time feel strong"}
{"thumbs_up":true,"text":"Hooked instantaneously! Cannot stop playing!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":7.6,"cleaned_text":"hook instant cannot stop play"}
{"thumbs_up":true,"text":"This has a slow start, and that's most likely the reason behind the rare negative reviews. Don't be put off by it, though! It'll take a few attempts for you to get far enough to unlock enough things, and before you know it, you'll see just how insane things can get.Only reason why I'm putting it down for now is because its too addicting, and I've got a lotta work to do!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":34.6,"cleaned_text":"slow start that like reason behind rare neat review dont put though till take attempt get far enough unlock enough thing know you see insane thing get reason im put addict ive got gotta work"}
{"thumbs_up":true,"text":"Floating damage numbers are digital crack.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":15.9,"cleaned_text":"float damage number digit crack"}
{"thumbs_up":true,"text":"Pure fun arcade game.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":4.7,"cleaned_text":"pure fun arcade game"}
{"thumbs_up":true,"text":"cool","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":12.6,"cleaned_text":"cool"}
{"thumbs_up":true,"text":"Want to waste time while enjoying a game at the same time? then Vampire Survivor is for you! you got an old man with garlic, a walking tree with empowered garlic, and a dog that farts flowers that explodes.You won't regret getting this cheap addicting game.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":66.3,"cleaned_text":"want wa time enjoy game time vampire survivor got old man garlic walk tree empty garlic dog fart flower explodesyou wont regret get cheap addict game"}
{"thumbs_up":true,"text":"Get book, make book angry, angry book go brr","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":37.8,"cleaned_text":"get book make book angry angry book go brr"}
{"thumbs_up":true,"text":"Probably the most fun I've had with a game in this price range. Highly recommend just giving it a try if you're on the fence about it.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":33.1,"cleaned_text":"probably fun ive game price rang high recommend give tri your enc"}
{"thumbs_up":true,"text":"digital cocaine","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":41.6,"cleaned_text":"digit cocaine"}
{"thumbs_up":true,"text":"Still a better love story than Twilight.","helpful_votes":0,"funny_votes":1,"reward":0,"gametime_record":18.4,"cleaned_text":"still better love story twilight"}
{"thumbs_up":true,"text":"Vampire Survivors is a game the what I would label as \"genre-defining.\" It's simple, arcade-y, and cheap, where quick runs of 30 min or less make this addicting but also time-manageable.  Instead of a bullethell where you are dodging, you become the bullethell itself, mowing down classic enemies in vain of Castlevania.Another thing this game does well is how runs can end, and there's always something to improve or scale on. Would this character's starter weapon help here instead of the one I've been using?  Maybe try a different set of weapons? Or a different location entirely? Combinations are meant to be explored, and most times they can amplify the fun. Sure there's a bunch of copies of this type of game now, but it's Vampire Survivors or nothing in my eyes.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":58.6,"cleaned_text":"vampire survivor game would label genredefin simply arcade cheap quick run 30 min le make addict also timemanag instead bulleted dog become bulleted row classic enemy vain castlevaniaanoth thing game well run end there away some improv scale would character starter weapon help instead one ive use may tri differ set weapon differ local entire combine meant explore time amplify fun sure there bunch copy type game vampire survivor not eye"}
{"thumbs_up":true,"text":"This game is such a fun time kill overall and appropriately challenging early on for resource appropriation.Starting off is obviously slow without any of the upgrades or heros unlocked but it's made in a way that is approachable to build to the challenge of wanting to and the actuality of surviving a full 30 minutes of wave after wave swarming attacks punctuated with bosses AND THEN a battle with death (and maybe even thereafter! note: thereafter is boss only territory and notably difficult; I highly recommend watching videos\/streams of this content if you are interested).I love the nostalgic graphics throughout the game and game interface. I personally find them to be both satisfying and suitable considering all else that is going on during the wave by wave game. I also enjoy that each ability has its own effects and animation for it. It's quite nice as you gather more to see how they interact together and how the graphic choices don't make it too overwhelming for the eyes even with everything going on.There is also a super nifty feature to make is controller compatible already built in so that is nice, too.I definitely 5\/5 Stars recommend this game if you've got some time to kill and six smackeroos to buy it especially if you like the nostalgic graphics.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":13.6,"cleaned_text":"game fun time kill overall appropri challenge early resource appropriationstart obvious slow without upgrade hero unlock made way approach build challenge want actual survive full 30 minut wave wave swarm attack punctuated bos battle death may even threat note threat bos territory notable difficult high recommend watch videosstream content interested love postal graphic throughout game game interface person find satisfy suitable consider el go wave wave game also enjoy bail effect anim quit nice gather see interact together graphic choice dont make overwhelm eye even every go other also super nifty feature make control combat already built nice took deficit 55 star recommend game you got time kill six smackeroo buy respect like postal graphic"}
{"thumbs_up":true,"text":"Great mind numbing fun when you feel like destroying thousands at once.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":147.3,"cleaned_text":"great mind num fun feel like destroy thousand"}
{"thumbs_up":true,"text":"Very fun and well created game.Good for when you want something simple.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":10.6,"cleaned_text":"fun well create gamegood want some simply"}
{"thumbs_up":true,"text":"No battlepass, daily quest grind, no outrageous money grabbing policy - thanks for this gem devs!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":52.1,"cleaned_text":"battlepass daily quest grind outrage money grab policy thank gem dev"}
{"thumbs_up":true,"text":"video game lovethis game. adiction. :steamhappy:","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":53.5,"cleaned_text":"video game lovethi game dict steamhappi"}
{"thumbs_up":true,"text":"\"me likey bread sticks, me likey bread sticks\"-Lois Griffin circa 2001, Season 3, Episode 7","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":49.4,"cleaned_text":"like bread stick like bread sticksloi griffin circa 2001 season 3 episode 7"}
{"thumbs_up":true,"text":"hehehe funny numbers go up","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":5.5,"cleaned_text":"here funny number go"}
{"thumbs_up":true,"text":"Can't stop won't stophelp me.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":38.5,"cleaned_text":"cant stop wont stophelp"}
{"thumbs_up":true,"text":"good","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":7.2,"cleaned_text":"good"}
{"thumbs_up":true,"text":"tis fun","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":42.1,"cleaned_text":"ti fun"}
{"thumbs_up":true,"text":"10\/10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":49.7,"cleaned_text":"1010"}
{"thumbs_up":true,"text":"The most fun I've had for under £5.00.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":55.5,"cleaned_text":"fun ive 500"}
{"thumbs_up":true,"text":"it's gambling without losing money (JK)Very fun single stick \"shooter\" that you can lose 100+ hours in","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":113.4,"cleaned_text":"gamble without lose money jkveri fun single stick shooter lose 100 hour"}
{"thumbs_up":true,"text":"n1","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":13.9,"cleaned_text":"n1"}
{"thumbs_up":true,"text":"---{ Graphics }---☐ You forget what reality is☐ Beautiful☑ Good☐ Decent☐ Bad☐ Don‘t look too long at it☐ MS-DOS---{ Gameplay }---☑ Very good☐ Good☐ It's just gameplay☐ Mehh☐ Watch paint dry instead☐ Just don't---{ Audio }---☐ Eargasm☑ Very good☐ Good☐ Not too bad☐ Bad☐ I'm now deaf---{ Audience }---☑ Kids☑ Teens☑ Adults☑ Grandma---{ PC Requirements }---☐ Check if you can run paint☑ Potato☐ Decent☐ Fast☐ Rich boi☐ Ask NASA if they have a spare computer---{ Difficulty }---☐ Just press 'W'☑ Easy☐ Easy to learn \/ Hard to master☐ Significant brain usage☐ Difficult☐ Dark Souls---{ Grind }---☐ Nothing to grind☐ Only if u care about leaderboards\/ranks☑ Isn't necessary to progress☐ Average grind level☐ Too much grind☐ You'll need a second life for grinding---{ Story }---☐ No Story☑ Some lore☐ Average☐ Good☐ Lovely☐ It'll replace your life---{ Game Time }---☐ Long enough for a cup of coffee☐ Short☐ Average☐ Long☑ To infinity and beyond---{ Price }---☐ It's free!☑ Worth the price☐ If it's on sale☐ If u have some spare money left☐ Not recommended☐ You could also just burn your money---{ Bugs }---☐ Never heard of☑ Minor bugs☐ Can get annoying☐ ARK: Survival Evolved☐ The game itself is a big terrarium for bugs---{ ? \/ 10 }---☐ 1☐ 2☐ 3☐ 4☐ 5☐ 6☐ 7☐ 8☑ 9☐ 10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":42.4,"cleaned_text":"graphic forget reality beauty good decent bad dont look long msds gameplay good good gameplay mesh watch paint doi instead dont audio sarcasm good good bad bad im deaf audience kid teen adult grand pc require check run paint potato decent fast rich boi ask nasa spare compute difficult press w east east learn hard master signifies brain usage difficult dark soul grind not grind u care leaderboardsrank isnt necessary progress average grind level much grind you need second life grind story story lore average good love till replace life game time long enough cup coffee short average long infin beyond price free worth price sale u spare money left recommend could also burn money bug never heard minor bug get annoy ark survive evolve game big terrorism bug 10 1 2 3 4 5 6 7 8 9 10"}
{"thumbs_up":true,"text":"amazing","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":15.4,"cleaned_text":"ama"}
{"thumbs_up":true,"text":"A very addicting bullet shooter. The developer deserves to be praised for creating one of the best games of 2022.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":3.0,"cleaned_text":"addict bullet shooter develop desert praise create one best game 2022"}
{"thumbs_up":true,"text":"this game is what it's like it have an addiction to crack10\/10 buy it for the whole family","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":23.1,"cleaned_text":"game like addict crack1010 buy whole family"}
{"thumbs_up":true,"text":"I played it for half an hour and there was so much crap on screen I could barely control my character until some red guy instant killed me.10\/10","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":61.4,"cleaned_text":"play half hour much crap screen could bare control character red guy instant kill me1010"}
{"thumbs_up":true,"text":"cool vamp[ire hunter kills vampires n ♥♥♥♥ until 30 minute and still ♥♥♥♥♥♥♥ dies","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":25.3,"cleaned_text":"cool vampire hunter kill vampire n 30 minut still die"}
{"thumbs_up":true,"text":"The stardew valley equivalent for people that speed run undertale genocide routes","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":16.6,"cleaned_text":"started valley equal people speed run underway genocide rout"}
{"thumbs_up":true,"text":"Fantastic game with a retro look like","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":60.3,"cleaned_text":"fantasy game retro look like"}
{"thumbs_up":true,"text":"Diablo for people with 2+ kg of microplastics in their brain stem. basically a perfect game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":58.8,"cleaned_text":"diablo people 2 kg microplast brain stem basic perfect game"}
{"thumbs_up":true,"text":"good game","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":28.7,"cleaned_text":"good game"}
{"thumbs_up":true,"text":"Super fun game and cool to unlock stuff. Very arcade-like.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":26.6,"cleaned_text":"super fun game cool unlock stuff arcadelik"}
{"thumbs_up":true,"text":"If you love Castlevania and Hades this is a game for you. Great games that really sank its hooks into me.  I was obsessed.  It gave me 40+ hours of delight.","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":47.9,"cleaned_text":"love castlevania have game great game really sank hook ass gave 40 hour delight"}
{"thumbs_up":true,"text":"Something that can keep me coming back. I would describe it as a \"Podcast\" type game, think of it as a game that can let you multitask while playing it.I would give it a 10\/10. Except I still think there should be more weapon variety that can counter the Red Death at the end of each session.In all, best game I've seen in my 20 years of gaming!","helpful_votes":0,"funny_votes":0,"reward":0,"gametime_record":380.1,"cleaned_text":"some keep come back would describe podcast type game think game let multitask play iti would give 1010 except still think weapon variety counter red death end session best game ive seen 20 year game"}
